tap 'caskroom/versions'

brew 'tmux'
brew 'gcc' # this will take a while...
brew 'gdb'
brew 'git' # although git comes with OS X, this way we get the latest version
brew 'tig' # ncurses based UI for git, just tig in a repo
brew 'fpp' # facebook path picker, do a `git status | fpp` to see what it can do
brew 'mtr' # network diagnostic tool, useful when somebody asks "did the internet just stop?"
brew 'nmap' # network security scanner
brew 'shellcheck' # shell script analyzer
brew 'python'
brew 'wget'
brew 'htop'
brew 'nano'
brew 'make'
brew 'node'

cask 'google-chrome'
cask 'java' # includes JDK
cask 'iterm2' # great terminal replacement
cask 'slack'
cask 'spectacle' # Easy window management
cask 'the-unarchiver' # unarchives most formats
cask 'little-snitch' # network monitoring
cask 'skype'
cask 'vagrant' # Great to manage development environments (requires VM software)
cask 'virtualbox'
cask 'intellij-idea-ce' # The Ultimate (paid) version is just `intellij-idea`
cask 'visual-studio-code' # open source text editor by Microsoft, on top of GitHub Atom
cask 'flux' # amazing tool that adjusts the color temperature of your monitor to ease it on your eyes
cask 'caffeine' # keeps your Mac awake when you want to
cask 'sourcetree' # Great GUI for Git, Subversion and Mercurial
cask 'spotify'
cask 'dropbox'
